commands_help: str = '''
    добавить грядку - add.\n
    удалить грядку "номер грядки" - rm 4.\n
    удобрить грядку "номер грядки" - fert 4.\n
    полить грядку "номер грядки" - water 4.\n
    вылечить грядку "номер грядки" - hp 4.\n
    посадить "дерево/растение" "название растения" "название его плодов" "номер грядки" - new t/p name product_name 4.\n
    уничтожить вредителей "номер грядки" - rmpest 4.\n
    прополоть грядку "номер грядки" - weed 4.\n
    собрать урожай "номер грядки" - take 4.\n
    погода - weather.\n
    урожай - harvest.\n
    далее - next.\n
    показать огород - show\n'''